In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv('D:/git/AMO4/datasets/train.csv')
test_df = pd.read_csv('D:/git/AMO4/datasets/test.csv')

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
df.drop(['PassengerId','Sex','Embarked','Name','Ticket'], axis =1, inplace =True)
test_df.drop(['PassengerId','Sex','Embarked','Name','Ticket'], axis =1, inplace =True)

In [ ]:
о классе (“Pclass”), поле (“Sex”) и возрасте (“Age”)

In [31]:
df2_train = df[['Pclass', 'Sex', 'Age']]
df2_test = test_df[['Pclass', 'Sex', 'Age']]

In [32]:
df2.head(10)

   Pclass     Sex   Age
0       3    male  22.0
1       1  female  38.0
2       3  female  26.0
3       1  female  35.0
4       3    male  35.0
5       3    male   NaN
6       1    male  54.0
7       3    male   2.0
8       3  female  27.0
9       2  female  14.0

In [13]:
df2_train.to_csv('D:/git/AMO4/datasets/train.csv')
df2_test.to_csv('D:/git/AMO4/datasets/test.csv')

In [27]:
mean_age = np.round(df2_train['Age'].mean())
mean_age

30.0

In [33]:
df2_train['Age'] = df2_train['Age'].fillna(mean_age)
df2_test['Age'] = df2_test['Age'].fillna(mean_age)

C:\Users\Admin\AppData\Local\Temp\ipykernel_2124\2904040866.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2_train['Age'] = df2_train['Age'].fillna(mean_age)
C:\Users\Admin\AppData\Local\Temp\ipykernel_2124\2904040866.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2_test['Age'] = df2_test['Age'].fillna(mean_age)

In [34]:
df2_train.head(10)

   Pclass     Sex   Age
0       3    male  22.0
1       1  female  38.0
2       3  female  26.0
3       1  female  35.0
4       3    male  35.0
5       3    male  30.0
6       1    male  54.0
7       3    male   2.0
8       3  female  27.0
9       2  female  14.0

In [35]:
df2_train.to_csv('D:/git/AMO4/datasets/train.csv')
df2_test.to_csv('D:/git/AMO4/datasets/test.csv')

In [36]:
d = pd.get_dummies(df2_train['Sex'])

In [38]:
df3_train = pd.get_dummies(df2_train, columns=['Sex'], drop_first=True)
df3_test = pd.get_dummies(df2_test, columns=['Sex'], drop_first=True)

In [39]:
df3_train.head()

   Pclass   Age  Sex_male
0       3  22.0      True
1       1  38.0     False
2       3  26.0     False
3       1  35.0     False
4       3  35.0      True

In [40]:
df3_train.to_csv('D:/git/AMO4/datasets/train.csv')
df3_test.to_csv('D:/git/AMO4/datasets/test.csv')